<h1>Sampling</h1>

Selecting a subset of data from a large population

In [1]:
import numpy as np
import pandas as pd

In [3]:

data = pd.DataFrame(
    {
        "customer_id":range(1,1001),
        "age":np.random.randint(18,65,1000),
        "income":np.random.randint(20000,200000, 1000),
        "purchased":np.random.choice([0,1],size=1000,p=[0.8,0.2])
    }
)

In [4]:
data

     customer_id  age  income  purchased
0              1   33   95455          1
1              2   45   95951          0
2              3   45   65714          0
3              4   37   21238          0
4              5   48   34344          0
..           ...  ...     ...        ...
995          996   25  186730          0
996          997   34  127924          0
997          998   23  187429          1
998          999   53  161666          0
999         1000   19  163397          0

[1000 rows x 4 columns]

In [16]:
sample_random = data.sample(n=200,random_state=42)

In [18]:
sample_random["purchased"].value_counts()

purchased
0    169
1     31
Name: count, dtype: int64

In [12]:
sample_random

     customer_id  age  income  purchased
521          522   19  195141          0
737          738   41  155344          0
740          741   64  109745          0
660          661   19  120018          0
411          412   49  184549          0
..           ...  ...     ...        ...
408          409   64   81622          0
332          333   38  170345          0
208          209   21  175964          0
613          614   41  189341          0
78            79   41   37558          1

[200 rows x 4 columns]

In [24]:
sample_random = data.sample(frac=0.2,random_state=34)

In [25]:
sample_random["purchased"].value_counts()

purchased
0    160
1     40
Name: count, dtype: int64

Train and test split

Stratified sampling

In [26]:
from sklearn.model_selection import train_test_split

X = data.drop("purchased",axis=1)
y =data["purchased"]

In [30]:
X

     customer_id  age  income
0              1   33   95455
1              2   45   95951
2              3   45   65714
3              4   37   21238
4              5   48   34344
..           ...  ...     ...
995          996   25  186730
996          997   34  127924
997          998   23  187429
998          999   53  161666
999         1000   19  163397

[1000 rows x 3 columns]

In [36]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,stratify=y,random_state=42)

In [38]:
y_test

339    0
661    0
515    1
727    0
352    1
      ..
651    1
521    0
610    0
817    0
846    0
Name: purchased, Length: 200, dtype: int64

In [48]:

y.value_counts(normalize=True)

purchased
0    0.815
1    0.185
Name: proportion, dtype: float64